neddybenchmark/reports/sc/apache/ab_c10.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.127 (be patient)


Server Software:        Apache/2.2.22
Server Hostname:        192.168.1.127
Server Port:            80

Document Path:          /index.html
Document Length:        177 bytes

Concurrency Level:      10
Time taken for tests:   122.767 seconds
Complete requests:      1000000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    1000000
Total transferred:      485000000 bytes
HTML transferred:       177000000 bytes
Requests per second:    8145.54 [#/sec] (mean)
Time per request:       1.228 [ms] (mean)
Time per request:       0.123 [ms] (mean, across all concurrent requests)
Transfer rate:          3858.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       2
Processing:     0    1   0.9      1     130
Waiting:        0    1   0.9      1     130
Total:          0    1   0.9      1     130

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      2
  98%      3
  99%      3
 100%    130 (longest request)