neddybenchmark/reports/sc/apache/ab_c100.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.127 (be patient)


Server Software:        Apache/2.2.22
Server Hostname:        192.168.1.127
Server Port:            80

Document Path:          /index.html
Document Length:        177 bytes

Concurrency Level:      100
Time taken for tests:   45.934 seconds
Complete requests:      1000000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    1000000
Total transferred:      485000000 bytes
HTML transferred:       177000000 bytes
Requests per second:    21770.60 [#/sec] (mean)
Time per request:       4.593 [ms] (mean)
Time per request:       0.046 [ms] (mean, across all concurrent requests)
Transfer rate:          10311.27 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0      13
Processing:     0    5   3.3      4     427
Waiting:        0    5   3.3      4     427
Total:          0    5   3.4      4     437

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      5
  75%      5
  80%      6
  90%      7
  95%      9
  98%     11
  99%     13
 100%    437 (longest request)