neddybenchmark/reports/sc/apache/ab_c50.log
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.127 (be patient)


Server Software:        Apache/2.2.22
Server Hostname:        192.168.1.127
Server Port:            80

Document Path:          /index.html
Document Length:        177 bytes

Concurrency Level:      50
Time taken for tests:   56.427 seconds
Complete requests:      1000000
Failed requests:        0
Write errors:           0
Keep-Alive requests:    1000000
Total transferred:      485000000 bytes
HTML transferred:       177000000 bytes
Requests per second:    17722.01 [#/sec] (mean)
Time per request:       2.821 [ms] (mean)
Time per request:       0.056 [ms] (mean, across all concurrent requests)
Transfer rate:          8393.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       3
Processing:     0    3   1.4      3      96
Waiting:        0    3   1.4      3      96
Total:          0    3   1.4      3      96

Percentage of the requests served within a certain time (ms)
  50%      3
  66%      3
  75%      3
  80%      3
  90%      4
  95%      4
  98%      4
  99%      5
 100%     96 (longest request)